src/Documents/РасходнаяНакладнаяЗадача_1/РасходнаяНакладнаяЗадача_1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладнаяЗадача_1</name>
  <registerRecords>AccumulationRegister.ОстаткиТовараЗадача_1</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура_Задача_1</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТовараЗадача_1/ОстаткиТовараЗадача_1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТовараЗадача_1</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура_Задача_1</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасходнаяНакладнаяЗадача_1/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	// регистр РегистрНакопления
	Движения.ОстаткиТовараЗадача_1.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТовараЗадача_1.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗадача_1Товары.Товар КАК Товар,
	|	РасходнаяНакладнаяЗадача_1Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РасходнаяНакладнаяЗадача_1.Товары КАК РасходнаяНакладнаяЗадача_1Товары
	|ГДЕ
	|	РасходнаяНакладнаяЗадача_1Товары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос2 = Новый Запрос();
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст =
	"ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовараЗадача_1.Остатки() КАК Остатки
	|		ПО ВТ_Товары.Товар = Остатки.Номенклатура";
	
	Выборка = Запрос2.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
	
		Если Выборка.КоличествоОстаток <= 0 Тогда
			Сообщить("Не хватает товара: " + Выборка.Номенклатура);
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	
КонецПроцедуры
